In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import sklearn as sk
%matplotlib inline
from sklearn.preprocessing import MinMaxScaler,StandardScaler,Normalizer
from sklearn.model_selection import train_test_split,cross_val_score,RandomizedSearchCV,GridSearchCV
from sklearn.impute import SimpleImputer
from sklearn.ensemble import RandomForestRegressor,GradientBoostingRegressor
from sklearn.pipeline import make_pipeline, Pipeline
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_percentage_error, mean_absolute_error
from sklearn.linear_model import LinearRegression, LogisticRegression, SGDRegressor
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree
from sklearn.metrics import accuracy_score
from scipy import stats

In [2]:
df = pd.read_csv(r'C:\Users\55944\Desktop\888/dataset.csv',index_col= 0)

In [3]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [5]:
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [6]:
for col in df.columns:
    print(col)

Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [7]:
list(df.columns)

['Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [8]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [10]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
df.drop(['Pclass','Name','Ticket','Cabin','Embarked'], axis=1,inplace=True,errors="ignore")
df

             Survived     Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0    male  22.0      1      0   7.2500
2                   1  female  38.0      1      0  71.2833
3                   1  female  26.0      0      0   7.9250
4                   1  female  35.0      1      0  53.1000
5                   0    male  35.0      0      0   8.0500
...               ...     ...   ...    ...    ...      ...
887                 0    male  27.0      0      0  13.0000
888                 1  female  19.0      0      0  30.0000
889                 0  female   NaN      1      2  23.4500
890                 1    male  26.0      0      0  30.0000
891                 0    male  32.0      0      0   7.7500

[891 rows x 6 columns]

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 48.7+ KB

In [13]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df.Sex = le.fit_transform(df.Sex)
df.head

<bound method NDFrame.head of              Survived  Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0    1  22.0      1      0   7.2500
2                   1    0  38.0      1      0  71.2833
3                   1    0  26.0      0      0   7.9250
4                   1    0  35.0      1      0  53.1000
5                   0    1  35.0      0      0   8.0500
...               ...  ...   ...    ...    ...      ...
887                 0    1  27.0      0      0  13.0000
888                 1    0  19.0      0      0  30.0000
889                 0    0   NaN      1      2  23.4500
890                 1    1  26.0      0      0  30.0000
891                 0    1  32.0      0      0   7.7500

[891 rows x 6 columns]>

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Sex       891 non-null    int32
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
dtypes: float64(2), int32(1), int64(3)
memory usage: 45.2 KB

In [15]:
df.describe(include = "all")

         Survived         Sex         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    0.647587   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.477990   14.526497    1.102743    0.806057   49.693429
min      0.000000    0.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    0.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    1.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    1.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    1.000000   80.000000    8.000000    6.000000  512.329200

In [16]:
df.isnull().sum()

Survived      0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
dtype: int64

In [17]:
 df.dropna(axis=0,inplace=True)

In [18]:
df.isnull().sum()

Survived    0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
dtype: int64

In [19]:
df.head

<bound method NDFrame.head of              Survived  Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0    1  22.0      1      0   7.2500
2                   1    0  38.0      1      0  71.2833
3                   1    0  26.0      0      0   7.9250
4                   1    0  35.0      1      0  53.1000
5                   0    1  35.0      0      0   8.0500
...               ...  ...   ...    ...    ...      ...
886                 0    0  39.0      0      5  29.1250
887                 0    1  27.0      0      0  13.0000
888                 1    0  19.0      0      0  30.0000
890                 1    1  26.0      0      0  30.0000
891                 0    1  32.0      0      0   7.7500

[714 rows x 6 columns]>

In [20]:
df.columns

Index(['Survived', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [21]:
df

             Survived  Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0    1  22.0      1      0   7.2500
2                   1    0  38.0      1      0  71.2833
3                   1    0  26.0      0      0   7.9250
4                   1    0  35.0      1      0  53.1000
5                   0    1  35.0      0      0   8.0500
...               ...  ...   ...    ...    ...      ...
886                 0    0  39.0      0      5  29.1250
887                 0    1  27.0      0      0  13.0000
888                 1    0  19.0      0      0  30.0000
890                 1    1  26.0      0      0  30.0000
891                 0    1  32.0      0      0   7.7500

[714 rows x 6 columns]

In [22]:
minmax_scaler=MinMaxScaler()
#обучение minmax_sceler создадим новую переменную
df_norm=minmax_scaler.fit_transform(np.array(df[['Survived', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare']]))

In [23]:
df_norm

array([[0.        , 1.        , 0.27117366, 0.2       , 0.        ,
        0.01415106],
       [1.        , 0.        , 0.4722292 , 0.2       , 0.        ,
        0.13913574],
       [1.        , 0.        , 0.32143755, 0.        , 0.        ,
        0.01546857],
       ...,
       [1.        , 0.        , 0.23347575, 0.        , 0.        ,
        0.0585561 ],
       [1.        , 1.        , 0.32143755, 0.        , 0.        ,
        0.0585561 ],
       [0.        , 1.        , 0.39683338, 0.        , 0.        ,
        0.01512699]])

In [24]:
array=df_norm

In [25]:
total = np.sum(array)
print(f'Sum of all the elements is {total}')

Sum of all the elements is 1178.580104011869

In [26]:
sum([453.000000,262.695275,73.200000,51.333333,48.351495])

888.5801030000001

In [27]:
x=888.5801030000001
print(round(x))

889

In [28]:
df_norm=pd.DataFrame(data=df_norm,columns=['Survived', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'])
df_norm.head

<bound method NDFrame.head of      Survived  Sex       Age  SibSp     Parch      Fare
0         0.0  1.0  0.271174    0.2  0.000000  0.014151
1         1.0  0.0  0.472229    0.2  0.000000  0.139136
2         1.0  0.0  0.321438    0.0  0.000000  0.015469
3         1.0  0.0  0.434531    0.2  0.000000  0.103644
4         0.0  1.0  0.434531    0.0  0.000000  0.015713
..        ...  ...       ...    ...       ...       ...
709       0.0  0.0  0.484795    0.0  0.833333  0.056848
710       0.0  1.0  0.334004    0.0  0.000000  0.025374
711       1.0  0.0  0.233476    0.0  0.000000  0.058556
712       1.0  1.0  0.321438    0.0  0.000000  0.058556
713       0.0  1.0  0.396833    0.0  0.000000  0.015127

[714 rows x 6 columns]>

In [29]:
df_norm.describe

<bound method NDFrame.describe of      Survived  Sex       Age  SibSp     Parch      Fare
0         0.0  1.0  0.271174    0.2  0.000000  0.014151
1         1.0  0.0  0.472229    0.2  0.000000  0.139136
2         1.0  0.0  0.321438    0.0  0.000000  0.015469
3         1.0  0.0  0.434531    0.2  0.000000  0.103644
4         0.0  1.0  0.434531    0.0  0.000000  0.015713
..        ...  ...       ...    ...       ...       ...
709       0.0  0.0  0.484795    0.0  0.833333  0.056848
710       0.0  1.0  0.334004    0.0  0.000000  0.025374
711       1.0  0.0  0.233476    0.0  0.000000  0.058556
712       1.0  1.0  0.321438    0.0  0.000000  0.058556
713       0.0  1.0  0.396833    0.0  0.000000  0.015127

[714 rows x 6 columns]>

In [30]:
from sklearn.preprocessing import StandardScaler

In [31]:
std_scaler=StandardScaler()
df_std=std_scaler.fit_transform(np.array(df[['Survived', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare']]))

In [32]:
df_std[:1]

array([[-0.82702011,  0.75905134, -0.53037664,  0.52457013, -0.50589515,
        -0.51897787]])

In [33]:
array=df_std
total = np.sum(array)
print(f'Sum of all the elements is {total}')

Sum of all the elements is 1.3855583347321954e-13

In [34]:
sum([5.506706e-14,1.669775e-13,-3.552714e-15,-5.151435e-14,-4.263256e-14])

1.2434493600000002e-13

In [35]:
x=1.2434493600000002e-13
print(round(x))

0

In [36]:
df_std=pd.DataFrame(data=df_std,columns=['Survived', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'])
df_std.head

<bound method NDFrame.head of      Survived       Sex       Age     SibSp     Parch      Fare
0    -0.82702  0.759051 -0.530377  0.524570 -0.505895 -0.518978
1     1.20916 -1.317434  0.571831  0.524570 -0.505895  0.691897
2     1.20916 -1.317434 -0.254825 -0.551703 -0.505895 -0.506214
3     1.20916 -1.317434  0.365167  0.524570 -0.505895  0.348049
4    -0.82702  0.759051  0.365167 -0.551703 -0.505895 -0.503850
..        ...       ...       ...       ...       ...       ...
709  -0.82702 -1.317434  0.640719 -0.551703  5.357890 -0.105320
710  -0.82702  0.759051 -0.185937 -0.551703 -0.505895 -0.410245
711   1.20916 -1.317434 -0.737041 -0.551703 -0.505895 -0.088774
712   1.20916  0.759051 -0.254825 -0.551703 -0.505895 -0.088774
713  -0.82702  0.759051  0.158503 -0.551703 -0.505895 -0.509523

[714 rows x 6 columns]>

In [37]:
df_std

     Survived       Sex       Age     SibSp     Parch      Fare
0    -0.82702  0.759051 -0.530377  0.524570 -0.505895 -0.518978
1     1.20916 -1.317434  0.571831  0.524570 -0.505895  0.691897
2     1.20916 -1.317434 -0.254825 -0.551703 -0.505895 -0.506214
3     1.20916 -1.317434  0.365167  0.524570 -0.505895  0.348049
4    -0.82702  0.759051  0.365167 -0.551703 -0.505895 -0.503850
..        ...       ...       ...       ...       ...       ...
709  -0.82702 -1.317434  0.640719 -0.551703  5.357890 -0.105320
710  -0.82702  0.759051 -0.185937 -0.551703 -0.505895 -0.410245
711   1.20916 -1.317434 -0.737041 -0.551703 -0.505895 -0.088774
712   1.20916  0.759051 -0.254825 -0.551703 -0.505895 -0.088774
713  -0.82702  0.759051  0.158503 -0.551703 -0.505895 -0.509523

[714 rows x 6 columns]